*** break statement

Java에서의 break statement를 쓰기 위해서는 다음과 같은 약간의 삽질이 필요하다:

다음과 같은 for loop을 옮기기 위해서는:

#+begin_src java
  for (int x = 0; i < 10; i++) {
        if (x == 5)
            break
        System.out.println(x)
  }  
#+end_src

다음과 같이 import를 하고, breakable 선언을 해 줘야 한다:

#+begin_src amm
  import scala.util.control.Breaks._
  
  breakable {
    for(x <- 0 to 9) {
      if (x == 5)
        break
      println(x)
    }
  }
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: import scala.util.control.Breaks._

됐쥬?

